Revit 2024 API
ElectricalSystem.SetCircuitPath Method
 Sets the electrical system circuit path by the list of node position.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public void SetCircuitPath(
	IList<XYZ> nodes
)
Visual Basic
Public Sub SetCircuitPath ( _
	nodes As IList(Of XYZ) _
)
Visual C++
public:
void SetCircuitPath(
	IList<XYZ^>^ nodes
)
Parameters
nodes
Type: System.Collections.Generic.IList<XYZ>
 The list of the circuit path node position.
Remarks
 If succeed, it will also change the CircuitPathMode property to Custom mode implicitly.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The list of the electrical system circuit path node position is not valid. The length of the list should be more than one, the first node should be the position of the panel where the circuit begins at, the adjacent nodes should not be too close, and should be in the same level or on the same vertical line, to keep each segment of the circuit path always horizontal or vertical. Also note that the first node position should be the position of the connector (the one connects to the circuit) of the panel, but not the origin of the panel instance.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Mechanical Electrical Piping.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace